//
//  DataArray.swift
//  DatingApp
//
//  Created by yuji_nakamoto on 2020/07/26.
//  Copyright © 2020 yuji_nakamoto. All rights reserved.
//

import UIKit

public let dataArray1 = [ "未設定", "130cm", "131cm", "132cm", "133cm", "134cm", "135cm", "136cm", "137cm", "137cm", "138cm", "139cm", "140cm", "141cm", "142cm", "143cm", "144cm", "145cm", "146cm", "147cm", "148cm", "149cm", "150cm", "151cm", "152cm", "153cm", "154cm", "155cm", "156cm", "157cm", "158cm", "159cm", "160cm", "161cm", "162cm", "163cm", "164cm", "165cm", "166cm", "167cm", "168cm", "169cm", "170cm", "171cm", "172cm", "173cm", "174cm", "175cm", "176cm", "177cm", "178cm", "179cm", "180cm", "181cm", "182cm", "183cm", "184cm", "185cm", "186cm", "187cm", "188cm", "189cm", "190cm", "191cm", "192cm", "193cm", "194cm", "195cm", "196cm", "197cm", "198cm", "199cm", "200cm"]

public let dataArray2 = [ "未設定", "スリム", "やや細め", "普通", "グラマー", "筋肉質", "ややぽっちゃり", "ぽっちゃり"]

public let dataArray3 = ["海外", "北海道", "青森", "岩手", "宮城", "秋田", "山形", "福島", "茨城", "栃木", "群馬", "埼玉", "千葉", "東京", "神奈川", "新潟", "富山", "石川", "福井", "山梨", "長野", "岐阜", "静岡", "愛知", "三重", "滋賀", "京都", "大阪", "兵庫", "奈良", "和歌山", "鳥取", "島根", "岡山", "広島", "山口", "徳島", "香川", "愛媛", "高知", "福岡", "佐賀", "長崎", "熊本", "大分", "宮崎", "鹿児島", "沖縄"]

public let dataArray4 = ["未設定", "会社員", "医師", "弁護士", "会計士", "経営者", "大手商社", "外資金融", "大手企業", "クリエイター", "IT関連", "航空関係", "芸能・モデル", "アパレル", "秘書", "看護師", "医療関係", "保育士", "自由業", "学生", "栄養士", "教育関連", "食品関連", "製造", "保険", "不動産", "美容関係", "建築関係", "旅行関係", "福祉・介護", "フリーランス", "美容師", "OL", "飲食関係", "消防士", "音楽関係", "その他"]

public let dataArray5 = [ "海外", "北海道", "青森", "岩手", "宮城", "秋田", "山形", "福島", "茨城", "栃木", "群馬", "埼玉", "千葉", "東京", "神奈川", "新潟", "富山", "石川", "福井", "山梨", "長野", "岐阜", "静岡", "愛知", "三重", "滋賀", "京都", "大阪", "兵庫", "奈良", "和歌山", "鳥取", "島根", "岡山", "広島", "山口", "徳島", "香川", "愛媛", "高知", "福岡", "佐賀", "長崎", "熊本", "大分", "宮崎", "鹿児島", "沖縄"]

public let dataArray6 = [ "未設定", "A型", "B型", "O型", "AB型", "わからない"]

public let dataArray7 = [ "未設定", "短大/専門学校/高専卒", "高校卒", "大学卒", "大学院卒", "その他"]

public let dataArray8 = [ "未設定", "独身(未婚)", "独身(離婚)"]

public let dataArray9 = [ "未設定", "すぐにしたい", "２〜３年のうちにしたい", "良い人がいればしたい", "今のところ考えてない", "まだわからない"]

public let dataArray10 = [ "未設定", "なし", "同居中", "別居中"]

public let dataArray11 = [ "未設定", "欲しい", "ほしくない", "落ち着いたら欲しい", "まだわからない"]

public let dataArray12 = [ "未設定", "一人暮らし", "友達と一緒", "ペットと一緒", "実家暮らし", "その他"]

public let dataArray13 = [ "未設定", "土日", "平日", "不定期", "その他"]

public let dataArray14 = [ "未設定", "飲まない", "飲む", "ときどき飲む"]

public let dataArray15 = [ "未設定", "吸わない", "吸う", "吸う(電子タバコ)", "ときどき吸う"]

public let dataArray16 = [ "選択する", "男性", "女性"]

public let dataArray17 = [ "すべて", "恋人募集", "友達募集", "メル友募集", "遊びたい", "ヒマしてる"]

public let dataArray18 = ["こだわらない", "海外", "北海道", "青森", "岩手", "宮城", "秋田", "山形", "福島", "茨城", "栃木", "群馬", "埼玉", "千葉", "東京", "神奈川", "新潟", "富山", "石川", "福井", "山梨", "長野", "岐阜", "静岡", "愛知", "三重", "滋賀", "京都", "大阪", "兵庫", "奈良", "和歌山", "鳥取", "島根", "岡山", "広島", "山口", "徳島", "香川", "愛媛", "高知", "福岡", "佐賀", "長崎", "熊本", "大分", "宮崎", "鹿児島", "沖縄"]

public let dataArray19 = [ "未設定", "130", "131", "132", "133", "134", "135", "136", "137", "137", "138", "139", "140", "141", "142", "143", "144", "145", "146", "147", "148", "149", "150", "151", "152", "153", "154", "155", "156", "157", "158", "159", "160", "161", "162", "163", "164", "165", "166", "167", "168", "169", "170", "171", "172", "173", "174", "175", "176", "177", "178", "179", "180", "181", "182", "183", "184", "185", "186", "187", "188", "189", "190", "191", "192", "193", "194", "195", "196", "197", "198", "199", "200"]
